{"overall": 5.0, "verified": true, "reviewTime": "11 9, 2012", "reviewerID": "A2M1CU2IRZG0K9", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "Terri", "reviewText": "So sorry I didn't purchase this years ago when it first came out!!  This is very good and entertaining!  We absolutely loved it and anticipate seeing it repeatedly.  We actually wore out the cassette years back, so we also purchased this same product on cd.  Best purchase we made out of all!  Would purchase on dvd if we could find one.", "summary": "Amazing!", "unixReviewTime": 1352419200}
{"overall": 5.0, "verified": true, "reviewTime": "12 30, 2011", "reviewerID": "AFTUJYISOFHY6", "asin": "0005089549", "style": {"Format:": " VHS Tape"}, "reviewerName": "Melissa D. Abercrombie", "reviewText": "Believe me when I tell you that you will receive a blessing watching this video of the Cathedral Quartet.  They bring back most of the singers that were ever in their group and it is a really great VHS.", "summary": "Great Gospel VHS of the Cathedrals!", "unixReviewTime": 1325203200}
{"overall": 5.0, "vote": "11", "verified": true, "reviewTime": "04 21, 2005", "reviewerID": "A3JVF9Y53BEOGC", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Anthony Thompson", "reviewText": "I have seen X live many times, both in the early days and their more recent reunion shows. Trust me when I say this: they never disappoint as a live band! This DVD document of a show on their home turf of LA is a dream come true. Can't wait.", "summary": "A great document of a great band", "unixReviewTime": 1114041600}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "04 6, 2005", "reviewerID": "A12VPEOEZS1KTC", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "JadeRain", "reviewText": "I was so excited for this!  Finally, a live concert video from X!  I've seen them twice, both times with Tony G. on guitar (he was superb by the way).  But we all know you HAVE to have Billy Zoom in the band. I haven't been able to see them, but this DVD will do the trick.  This DVD is AMAZING!! One listen/viewing makes me instantly forget all the \"power pop\" \"punk\" bands that are around now.  Their sound is fantastic, full, fast, heavy, thrilling!  All the members sound excellent, period.  I'm hopeful that there will be a tour, come on X!  Us old fogeys would like to see you old fogeys play your beautiful music for us!! UPDATE:  I've been so lucky to catch X a couple of times with Billy on guitar since I wrote this, it was just incredible seeing them, this DVD does give an accurate view of what it is like to have X RIPPING it up in concert!  cheers.", "summary": "YES!!  X LIVE!!", "unixReviewTime": 1112745600}
{"overall": 5.0, "vote": "5", "verified": true, "reviewTime": "12 3, 2010", "reviewerID": "ATLZNVLYKP9AZ", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "T. Fisher", "reviewText": "X is one of the best punk bands ever. I don't even like calling them a punk band, but that's what they call themselves so I guess it's OK. This is musically complex punk with a lot of influences and a lot of tight playing and gripping tunes.\n\nThis is an awesome concert. The only two problems are that 1) it is just 67 minutes long and 2) John Doe's bass is buried too deep in the mix.\n\nEvery X fan should get this. More importantly, anyone who doesn't know about X should get this.\n\nWhy X? Did you know, for example, that:\n- X has a different sound based on the unique harmonies between co-lead singers Exene Cervenka and John Doe that really sets them apart from anything else out there?\n- Doe, Cervenka and drummer DJ Bonebrake also play in the country punk band The Knitters?\n- Billy Zoom, the guitarist who originally formed the band, used to play rockabilly guitar for Gene Vincent and other big stars, and has been voted one of the greatest guitar players ever by Guitar Player magazine?\n- X were playing Leadbelly tunes way before Kurt Cobain?\n- Ray Manzarek, keyboard player of The Doors, produced X's first four albums? This is one of the big reasons why the band covered and generally closed its concerts with \"Soul Kitchen\" from the album&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/The-Doors/dp/B000MCIBE8/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">The Doors</a>\n- Cervenka and Doe used to be married, before Exene later married Viggo Mortensen -- Aragorn from the Lord of the Rings movies?\n- Billy Zoom left the band from the mid-1980s to the mid-1990s, but during this time the band still managed to record&nbsp;<a data-hook=\"product-link-linked\" class=\"a-link-normal\" href=\"/X-Live-at-the-Whisky-a-Go-Go/dp/B000005IRW/ref=cm_cr_arp_d_rvw_txt?ie=UTF8\">X Live at the Whisky a Go-Go</a>, one of the greatest live rock albums ever, with guitarist Tony Gilkyson?\n\nAs this DVD proves, X is still as good as ever. Billy Zoom still plays standing in his trademark splayed-leg stance with a broad grin on his face. Did I say he is awesome? Awesome.\n\nI waited way too long before getting this one, thinking I could do without an X DVD. And I could have. But why should I? This really is worth it, and I'm sure I'll be putting this one in the player more often than a lot of my other music DVDs. Really, really good.", "summary": "X have still got it", "unixReviewTime": 1291334400}
{"overall": 5.0, "verified": true, "reviewTime": "10 17, 2007", "reviewerID": "A3TNYNA2360NPA", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "Stanley  C. Sargent", "reviewText": "I've loved X since I first saw them here in San Francisco with, I believe, Devo and Romeo Void.  Romeo Void was a disaster due to the tiny outfit Deborah squeezed her huge body into; the audience couldn't stand to look at her even when the music was good. Devo was quite good. Then X came on stage and it was like hearing a great music system play compared to a tinny radio's sound. Man, they were great and they, unlike 99% of the other \"new wave/punk\" bands of the era were pros.  They had it down and played it up. I loved them! Watching this excellent reunion video (yes, Billy Zoom still has that same perpetual, inane smile on his face while playing), I was surprised to see very much the same show I saw all those years ago, with some extra songs that came out later, that is. The band's still electrifying. I'd like to see them \"live\" again, but until then, this video is the next best thing. It's well filmed and has a great selection of their best songs. Sure, they aren't as \"pretty\" as they used to be, but before you say too much, check your rearview mirror to see how you look now compared to 20 some odd years ago. Then, once humbled, go buy this CD. You will love it!", "summary": "A Revival to match the early shows by a great band", "unixReviewTime": 1192579200}
{"overall": 5.0, "vote": "17", "verified": true, "reviewTime": "11 8, 2005", "reviewerID": "A2LUL6PRTXE7SE", "asin": "000503860X", "style": {"Format:": " DVD"}, "reviewerName": "PSM/Bokor", "reviewText": "I must admit I was hesitant to purchase this DVD. A classic punk band performing twenty plus years later, what could one expect? Apparently, one can expect a hell of a lot. These guys and gal can still tear their songs apart.\n\nIt's well filmed; there isn't that MTV, rapid editing that can cause seizures. The audio is excellent; you can actually understand the lyrics. It's well mixed. It's far superior to a lot of live performance DVD's currently released by some bands. X released a product that is worthy of ones money.\n\nIf you like X; you'll love this DVD. If you just appreciate a good rock/punk concert, you won't be disappointed.", "summary": "Old punks still rule...", "unixReviewTime": 1131408000}
{"overall": 5.0, "verified": true, "reviewTime": "04 12, 2016", "reviewerID": "A2CFV9UPFTTM10", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "SuzieQ", "reviewText": "The little ones love this", "summary": "Love it", "unixReviewTime": 1460419200}
{"overall": 3.0, "verified": true, "reviewTime": "07 28, 2014", "reviewerID": "A3139J3877Y61F", "asin": "0005419263", "style": {"Format:": " Audio CD"}, "reviewerName": "SingingButterfly", "reviewText": "Good songs. The DVD is a little boring.", "summary": "Three Stars", "unixReviewTime": 1406505600}
{"overall": 5.0, "verified": true, "reviewTime": "12 21, 2010", "reviewerID": "A2PANT8U0OJNT4", "asin": "0005419263", "style": {"Format:": " DVD"}, "reviewerName": "Cutegirlmomma", "reviewText": "The DVD came in great condition and provided lots of entertaining minutes of reliving the past.  Definitely worth the money.", "summary": "Blast from the past", "unixReviewTime": 1292889600}
